index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2024-04-14 Sun 18:22 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Vim Configuration File</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Kristian Alexander P" />
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/readtheorg.css"/>
</head>
<body>
<div id="content">
<h1 class="title">Vim Configuration File</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org60190b5">1. <code>~/.config/vim/vimrc</code></a>
<ul>
<li><a href="#org998888a">1.1. set default directories</a></li>
<li><a href="#orgaf4a630">1.2. Sane default from <i>archlinux</i></a></li>
<li><a href="#orgb20a950">1.3. move temporary files into a secure location</a></li>
<li><a href="#org2d21845">1.4. Make shift-insert work like in Xterm</a></li>
<li><a href="#orge9a2378">1.5. Misc sane defaults</a></li>
<li><a href="#org5c0fea6">1.6. modular</a>
<ul>
<li><a href="#org7de6aad">1.6.1. plug</a></li>
<li><a href="#org90c53d8">1.6.2. keybindings</a></li>
<li><a href="#orgc0a6a01">1.6.3. ui</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-org60190b5" class="outline-2">
<h2 id="org60190b5"><span class="section-number-2">1</span> <code>~/.config/vim/vimrc</code></h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-org998888a" class="outline-3">
<h3 id="org998888a"><span class="section-number-3">1.1</span> set default directories</h3>
<div class="outline-text-3" id="text-1-1">
<div class="org-src-container">
<pre class="src src-vimrc">" XDG Base Directory {{{
"from https://wiki.archlinux.org/title/Vim
if empty($XDG_CACHE_HOME)  | let $XDG_CACHE_HOME  = $HOME."/.cache"       | endif
if empty($XDG_CONFIG_HOME) | let $XDG_CONFIG_HOME = $HOME."/.config"      | endif
if empty($XDG_DATA_HOME)   | let $XDG_DATA_HOME   = $HOME."/.local/share" | endif
if empty($XDG_STATE_HOME)  | let $XDG_STATE_HOME  = $HOME."/.local/state" | endif

set runtimepath^=$XDG_CONFIG_HOME/vim
set runtimepath+=$XDG_DATA_HOME/vim
set runtimepath+=$XDG_CONFIG_HOME/vim/after

set packpath^=$XDG_DATA_HOME/vim,$XDG_CONFIG_HOME/vim
set packpath+=$XDG_CONFIG_HOME/vim/after,$XDG_DATA_HOME/vim/after

let g:netrw_home = $XDG_DATA_HOME."/vim"
call mkdir($XDG_DATA_HOME."/vim/spell", 'p')

set backupdir=$XDG_STATE_HOME/vim/backup | call mkdir(&amp;backupdir, 'p')
set directory=$XDG_STATE_HOME/vim/swap   | call mkdir(&amp;directory, 'p')
set undodir=$XDG_STATE_HOME/vim/undo     | call mkdir(&amp;undodir,   'p')
set viewdir=$XDG_STATE_HOME/vim/view     | call mkdir(&amp;viewdir,   'p')
call mkdir($XDG_DATA_HOME."/vim/spell", 'p', 0700)

if !has('nvim') | set viminfofile=$XDG_STATE_HOME/vim/viminfo | endif
" }}}
</pre>
</div>
</div>
</div>
<div id="outline-container-orgaf4a630" class="outline-3">
<h3 id="orgaf4a630"><span class="section-number-3">1.2</span> Sane default from <i>archlinux</i></h3>
<div class="outline-text-3" id="text-1-2">
<p>
Use Vim defaults instead of 100% vi compatibility
</p>
<div class="org-src-container">
<pre class="src src-vimrc">if &amp;compatible
  set nocompatible
endif
</pre>
</div>
</div>
</div>
<div id="outline-container-orgb20a950" class="outline-3">
<h3 id="orgb20a950"><span class="section-number-3">1.3</span> move temporary files into a secure location</h3>
<div class="outline-text-3" id="text-1-3">
<div class="org-src-container">
<pre class="src src-vimrc">if exists('$XDG_CACHE_HOME')
  let &amp;g:directory=$XDG_CACHE_HOME
else
  let &amp;g:directory=$HOME . '/.cache'
endif
let &amp;g:undodir=&amp;g:directory . '/vim/undo//'
let &amp;g:backupdir=&amp;g:directory . '/vim/backup/'
let &amp;g:directory.='/vim/swap//'
" Create directories if they doesn't exist
if ! isdirectory(expand(&amp;g:directory))
  silent! call mkdir(expand(&amp;g:directory), 'p', 0700)
endif
if ! isdirectory(expand(&amp;g:backupdir))
  silent! call mkdir(expand(&amp;g:backupdir), 'p', 0700)
endif
if ! isdirectory(expand(&amp;g:undodir))
  silent! call mkdir(expand(&amp;g:undodir), 'p', 0700)
endif
</pre>
</div>
</div>
</div>
<div id="outline-container-org2d21845" class="outline-3">
<h3 id="org2d21845"><span class="section-number-3">1.4</span> Make shift-insert work like in Xterm</h3>
<div class="outline-text-3" id="text-1-4">
<div class="org-src-container">
<pre class="src src-vimrc">if has('gui_running')
  map &lt;S-Insert&gt; &lt;MiddleMouse&gt;
  map! &lt;S-Insert&gt; &lt;MiddleMouse&gt;
endif
</pre>
</div>
</div>
</div>
<div id="outline-container-orge9a2378" class="outline-3">
<h3 id="orge9a2378"><span class="section-number-3">1.5</span> Misc sane defaults</h3>
<div class="outline-text-3" id="text-1-5">
<div class="org-src-container">
<pre class="src src-vimrc">" Load plugins according to detected filetype.
filetype plugin indent on  
" Enable syntax highlighting.
syntax on                  
" Indent according to previous line.
set autoindent             
" Use spaces instead of tabs.
set expandtab              
" Tab key indents by 4 spaces.
set softtabstop =4         
" &gt;&gt; indents by 4 spaces.
set shiftwidth  =4         
" &gt;&gt; indents to next multiple of 'shiftwidth'.
set shiftround             
" Make backspace work as you would expect.
set backspace   =indent,eol,start  
" Switch between buffers without having to save first.
set hidden                 
" Always show statusline.
set laststatus  =2         
" Show as much as possible of the last line.
set display     =lastline  
" Show current mode in command-line.
set showmode               
" Show already typed keys when more are expected.
set showcmd                
" Highlight while searching with / or ?.
set incsearch              
" Keep matches highlighted.
set hlsearch               
" Faster redrawing.
set ttyfast                
" Only redraw when necessary.
set lazyredraw             
" Open new windows below the current window.
set splitbelow             
" Open new windows right of the current window.
set splitright             
" Find the current line quickly.
set cursorline             
" Searches wrap around end-of-file.
set wrapscan               
" Always report changed lines.
set report      =0         
" Only highlight the first 200 columns.
set synmaxcol   =200       
" Show non-printable characters.
set list                   
set noruler
if has('multi_byte') &amp;&amp; &amp;encoding ==# 'utf-8'
  let &amp;listchars = 'tab:▸ ,extends:❯,precedes:❮,nbsp:±'
else
  let &amp;listchars = 'tab:&gt; ,extends:&gt;,precedes:&lt;,nbsp:.'
endif
" Ignore case when searching
set ignorecase
" When searching try to be smart about cases
set smartcase
" Show matching brackets when text indicator is over them
set showmatch
</pre>
</div>
</div>
</div>
<div id="outline-container-org5c0fea6" class="outline-3">
<h3 id="org5c0fea6"><span class="section-number-3">1.6</span> modular</h3>
<div class="outline-text-3" id="text-1-6">
<div class="org-src-container">
<pre class="src src-vimrc">runtime modules/plug.vim
runtime modules/keybindings.vim
runtime modules/ui.vim
</pre>
</div>
</div>
<div id="outline-container-org7de6aad" class="outline-4">
<h4 id="org7de6aad"><span class="section-number-4">1.6.1</span> plug</h4>
<div class="outline-text-4" id="text-1-6-1">
<div class="org-src-container">
<pre class="src src-vimrc">call plug#begin(has('nvim') ? stdpath('data') . '/plugged' : '~/.local/share/vim/plugged')

Plug 'preservim/nerdtree'
Plug 'easymotion/vim-easymotion'

call plug#end()
</pre>
</div>
</div>
</div>
<div id="outline-container-org90c53d8" class="outline-4">
<h4 id="org90c53d8"><span class="section-number-4">1.6.2</span> keybindings</h4>
<div class="outline-text-4" id="text-1-6-2">
<div class="org-src-container">
<pre class="src src-vimrc">let mapleader = "\&lt;Space&gt;"

" Fast saving
nmap &lt;leader&gt;w :w!&lt;cr&gt;

" :W sudo saves the file
" (useful for handling the permission-denied error)
command! W execute 'w !sudo tee % &gt; /dev/null' &lt;bar&gt; edit!

" Close the current buffer
map &lt;leader&gt;bd :Bclose&lt;cr&gt;:tabclose&lt;cr&gt;gT

" Close all the buffers
map &lt;leader&gt;ba :bufdo bd&lt;cr&gt;

map &lt;leader&gt;l :bnext&lt;cr&gt;
map &lt;leader&gt;h :bprevious&lt;cr&gt;
</pre>
</div>
</div>
</div>
<div id="outline-container-orgc0a6a01" class="outline-4">
<h4 id="orgc0a6a01"><span class="section-number-4">1.6.3</span> ui</h4>
<div class="outline-text-4" id="text-1-6-3">
<div class="org-src-container">
<pre class="src src-vimrc">" Enable syntax highlighting
syntax enable

" Set regular expression engine automatically
set regexpengine=0

" Enable 256 colors palette in Gnome Terminal
if $COLORTERM == 'gnome-terminal'
    set t_Co=256
endif

" Set extra options when running in GUI mode
if has("gui_running")
    set guioptions-=T
    set guioptions-=e
    set t_Co=256
    set guitablabel=%M\ %t
endif

" Set utf8 as standard encoding and en_US as the standard language
set encoding=utf8

" Use Unix as the standard file type
set ffs=unix,dos,mac

" Disable scrollbars (real hackers don't use scrollbars for navigation!)
set guioptions-=r
set guioptions-=R
set guioptions-=l
set guioptions-=L

" No annoying sound on errors
set noerrorbells
set novisualbell
set t_vb=
set tm=500

" set mouse for all modes
set mouse=a
set mousemodel=popup_setpos
silent! set ttymouse=sgr

" title
set title
set titlestring=
set titlestring+=%t%(\ %M%)%(\ (%{expand(\"%:p:~:.:h\")}/)%)
set titlestring+=\ \|\ %{$USER}@%{hostname()}:%{substitute(getcwd(),$HOME,'~','')}

" Start NERDTree, unless a file or session is specified, eg. vim -S session_file.vim.
autocmd StdinReadPre * let s:std_in=1
autocmd VimEnter * if argc() == 0 &amp;&amp; !exists('s:std_in') &amp;&amp; v:this_session == '' | NERDTree | endif

" Close the tab if NERDTree is the only window remaining in it.
autocmd BufEnter * if winnr('$') == 1 &amp;&amp; exists('b:NERDTree') &amp;&amp; b:NERDTree.isTabTree() | quit | endif
</pre>
</div>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: 2024-03-24 Sun 00:00</p>
<p class="author">Author: Kristian Alexander P</p>
<p class="date">Created: 2024-04-14 Sun 18:22</p>
</div>
</body>
</html>
